package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution
{
    public static void main(String[] args)
    {
        String a = "30", b = "01", c = "2016";
        System.out.println(a+" "+b+" "+c);
    }
}
